brew "mas"

# Some other useful utilities like `sponge` and `yadm`
brew "moreutils"
brew "yadm"

# GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew "findutils"

# GNU `sed`, overwriting the built-in `sed`.
brew "gnu-sed"

# Modern version of Bash.
brew "bash"
brew "bash-completion"
brew "bash-completion@2", link: false # Not sure if this is needed

# `wget` with IRI support.
brew "wget"

# GnuPG to enable PGP-signing commits.
brew "gnupg"

# Libraries
brew "lz4"
brew "zlib"
brew "zstd"
brew "libffi"

# more recent versions of some macOS tools.
brew "vim"
brew "grep"
brew "openssh"
brew "screen"
brew "gmp"

# Font tools
tap "bramstein/webfonttools"
tap "homebrew/cask-drivers"
brew "sfnt2woff"
brew "sfnt2woff-zopfli"
brew "woff2"

# Programming languages
brew "golang"
brew "python@3.10"
brew "rust"

# Other useful binaries
brew "ack"
brew "git"
brew "git-lfs"
brew "gs"
brew "lua"
brew "p7zip"
brew "pigz"
brew "pv"
brew "rename"
brew "rlwrap"
brew "ssh-copy-id"
brew "tree"
brew "vbindiff"
brew "zopfli"
brew "ghq"
brew "kubectl"
brew "emacs"
brew "nmap"
brew "fork-cleaner"
brew "whalebrew"
brew "helm"
brew "gh"
brew "microplane"
brew "jq"
brew "rclone"
brew "asciinema"
brew "goreleaser"
brew "caddy"
brew "git-secret"
brew "pnpm"
brew "tmate"
brew "doctl"
brew "cilium-cli"
brew "act"

# Active taps: Pulumi ❤️
tap "pulumi/tap"
brew "pulumi"
brew "crd2pulumi"
brew "kube2pulumi"
brew "pulumictl"
brew "tf2pulumi"

## Taskfile.dev
tap "go-task/tap"
brew "go-task"

## Buf
tap "bufbuild/buf"
brew "buf"
brew "clang-format"

## Minio
tap "minio/stable"
brew "mc"

# Container-related tools
brew "podman"
brew "podman-compose"
cask "podman-desktop"

# Tools to keep us up to date
tap "frdmn/formulas"
brew "homebrew-update-notifier" # Remember to run: brew services start homebrew-update-notifier

# Taskfile
tap "go-task/tap"
brew "go-task"

# Actively used applications
cask "google-drive"
cask "google-chrome"
cask "google-drive-file-stream"
cask "visual-studio-code"
cask "google-cloud-sdk"
cask "spotify"
cask "memory"
cask "slack"
cask "postman"
cask "sonos"
cask "drawio"
cask "figma"
cask "discord"
cask "warp"
cask "steam"
cask "grammarly"
cask "microsoft-remote-desktop"
cask "minecraft"
cask "postico"
cask "cyberduck"
cask "pandoc"
cask "todoist"

# Deprecated applications
cask "adobe-creative-cloud" # Expires at 2023-04-01?

# My tools
tap "cobraz/tools"
brew "trippl-timely"
brew "xlsx-mxlookup"

# App Store applications
mas "Bitwarden", id: 1352778147
mas "GarageBand", id: 682658836
mas "Gifski", id: 1351639930
mas "LanScan", id: 472226235
mas "Microsoft Remote Desktop", id: 1295203466
mas "Outline", id: 1356178125
mas "Remote Desktop", id: 409907375
mas "SonicWall Mobile Connect", id: 822514576