brew "mas"

brew "ghq"
brew "moreutils"
brew "yadm"
brew "zsh"

# GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew "findutils"

# GNU `sed`, overwriting the built-in `sed`.
brew "gnu-sed"

# Modern version of Bash.
brew "bash"
brew "bash-completion"
brew "bash-completion@2", link: false # Not sure if this is needed

# `wget` with IRI support.
brew "wget"

# GnuPG to enable PGP-signing commits.
brew "gnupg"

# Libraries
brew "lz4"
brew "zlib"
brew "zstd"
brew "libffi"

# more recent versions of some macOS tools.
brew "grep"
brew "openssh"
brew "screen"
brew "gmp"

# Font tools
tap "bramstein/webfonttools"
tap "homebrew/cask-drivers"
brew "sfnt2woff"
brew "sfnt2woff-zopfli"
brew "woff2"
cask "font-symbols-only-nerd-font"
cask "font-jetbrains-mono"

# Programming languages
brew "golang"
brew "python@3.10"
brew "rust"
brew "zig"

# Restish
brew "danielgtaylor/restish/restish"

# Other useful binaries
brew "ripgrep"
brew "ack"
brew "git"
brew "git-lfs"
brew "gs"
brew "lua"
brew "p7zip"
brew "pigz"
brew "pv"
brew "rename"
brew "rlwrap"
brew "ssh-copy-id"
brew "tree"
brew "vbindiff"
brew "zopfli"
brew "kubectl"
brew "nmap"
brew "whalebrew"
brew "gh"
brew "microplane"
brew "jq"
brew "fzf"
brew "rclone"
brew "asciinema"
brew "goreleaser"
brew "caddy"
brew "git-secret"
brew "tmate"
brew "doctl"
brew "act"
cask "karabiner-elements"
brew "dasel"
brew "tldr"
brew "pkl"
brew "lazygit"
brew "yq"
tap "danielgtaylor/restish"
brew "restish"

# Javascript Runtimes and tools 
tap "oven-sh/bun"
brew "bun"
brew "pnpm"
brew "volta"
brew "corepack"
brew "deno"

# IaC / Cloud
tap "pulumi/tap"
brew "pulumi"
brew "crd2pulumi"
brew "kube2pulumi"
brew "pulumictl"
brew "tf2pulumi"
brew "esc"
brew "helm"
brew "cilium-cli"
brew "azure-cli"

# Container-related tools
cask "docker"
brew "podman"
brew "podman-compose"
cask "podman-desktop"

# Taskfile
tap "go-task/tap"
brew "go-task"

# Google stuff
cask "google-chrome"
cask "google-drive-file-stream"
cask "google-drive"
cask "google-cloud-sdk"

# Turso
tap "tursodatabase/tap"
brew "turso"

# Video meetings
cask "microsoft-teams"
cask "zoom"

# Actively used applications
cask "visual-studio-code"
cask "spotify"
brew "neovim"
cask "slack"
cask "sonos"
brew "tmux"
cask "figma"
cask "discord"
cask "grammarly"
cask "microsoft-remote-desktop"
cask "postico"
cask "cyberduck"
cask "adobe-creative-cloud"
cask "1password"
cask "openvpn-connect"
cask "raycast"
cask "wezterm" 
cask "rectangle"

# Obsidian stuff
cask "obsidian"
tap "yakitrak/yakitrak"

# My tools
tap "simenandre/tools"
brew "trippl-timely"
brew "xlsx-mxlookup"

# App Store applications
mas "Outline", id: 1356178125
mas "Remote Desktop", id: 409907375
