aaron-bond.better-comments
bungcip.better-toml
Dart-Code.dart-code
Dart-Code.flutter
DavidAnson.vscode-markdownlint
dbaeumer.jshint
dbaeumer.vscode-eslint
DevonDCarew.bazel-code
dsznajder.es7-react-js-snippets
duynvu.dbml-language
eamodio.gitlens
EditorConfig.EditorConfig
esbenp.prettier-vscode
fabiospampinato.vscode-diff
# felixfbecker.php-intellisense
foxundermoon.shell-format
gamunu.vscode-yarn
golang.go
GraphQL.vscode-graphql
hashicorp.terraform
HookyQR.beautify
iceyer.toml-formatter
jebbs.plantuml
jock.svg
jpoissonnier.vscode-styled-components
KnisterPeter.vscode-commitizen
kokororin.vscode-phpfmt
kumar-harsh.graphql-for-vscode
mermade.openapi-lint
Mikael.Angular-BeastCode
mikeburgh.xml-format
ms-azuretools.vscode-docker
ms-python.python
ms-toolsai.jupyter
ms-vscode.atom-keybindings
Orta.vscode-jest
osohq.oso
redhat.vscode-yaml
ronnidc.nunjucks
silvenon.mdx
sodatea.velocity
wholroyd.jinja
xaver.clang-format
zhuangtongfa.material-theme
znck.grammarly
zxh404.vscode-proto3
