# Taps
tap "bramstein/webfonttools"           # Tools for working with web fonts
tap "homebrew/cask-drivers"            # Tap for cask drivers
tap "danielgtaylor/restish"            # REST API client
tap "oven-sh/bun"                      # Bun JavaScript runtime
tap "pulumi/tap"                       # Pulumi infrastructure as code tools
tap "go-task/tap"                      # Task runner for Go
tap "tursodatabase/tap"                # Turso database tools
tap "libsql/sqld"
tap "yakitrak/yakitrak"                # Tap for yakitrak tools
tap "simenandre/tools"                 # Tap for Simen Andre's tools

# Mas
brew "mas"                             # Mac App Store command-line interface
mas "Outline", id: 1356178125          # Outline VPN
mas "Remote Desktop", id: 409907375    # Microsoft Remote Desktop application

# Shells and Shell Utilities
brew "zsh"                             # Z shell
brew "bash"                            # Modern version of Bash
brew "bash-completion"                 # Bash completion
brew "ghq"                             # Manage remote repository clones
brew "moreutils"                       # Collection of additional Unix utilities

# GNU Tools
brew "findutils"                       # GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew "gnu-sed"                         # GNU `sed`, overwriting the built-in `sed`.
brew "grep"                            # More recent version of macOS `grep`
brew "stow"

# Networking Tools
brew "wget"                            # `wget` with IRI support.
brew "openssh"                         # OpenSSH utilities
brew "nmap"                            # Network mapper

# Security and Encryption
brew "gnupg"                           # GnuPG to enable PGP-signing commits.
brew "git-secret"                      # Bash tool to store encrypted secrets in a Git repository
brew "ssh-copy-id"                     # Add SSH key to a server's authorized_keys

# Compression Libraries and Tools
brew "lz4"                             # Compression library
brew "zlib"                            # Compression library
brew "zstd"                            # Compression library
brew "libffi"                          # Foreign Function Interface library
brew "p7zip"                           # File archiver with high compression ratio
brew "pigz"                            # Parallel implementation of gzip
brew "zopfli"                          # Compression tool

# Programming Languages and Runtimes
brew "golang"                          # Go programming language
brew "python@3.11"                     # Python 3.11
brew "rust"                            # Rust programming language
brew "zig"                             # Zig programming language
brew "pkl"                             # Configuration language

# Font Tools
brew "sfnt2woff"                       # Convert TTF to WOFF
brew "sfnt2woff-zopfli"                # Convert TTF to WOFF (with Zopfli compression)
brew "woff2"                           # Convert TTF to WOFF2
cask "font-symbols-only-nerd-font"     # Symbols Only Nerd Font
cask "font-jetbrains-mono"             # JetBrains Mono font

# JavaScript Runtimes and Package Managers
brew "bun"                             # Bun JavaScript runtime
brew "pnpm"                            # Fast, disk space efficient package manager
brew "volta"                           # JavaScript tool manager
brew "corepack"                        # Yarn and pnpm binary manager
brew "deno"                            # Secure JavaScript and TypeScript runtime

# REST API Clients
brew "danielgtaylor/restish/restish"   # REST API client

# Version Control
brew "git"                             # Distributed version control system
brew "git-lfs"                         # Git extension for versioning large files
brew "lazygit"                         # Simple terminal UI for git commands
brew "microplane"                      # Tool for mass refactoring

# Search Tools
brew "ripgrep"                         # Line-oriented search tool
brew "ack"                             # Search tool like grep, optimized for programmers
brew "fzf"                             # Command-line fuzzy finder

# JSON/YAML Processing Tools
brew "jq"                              # Command-line JSON processor
brew "yq"                              # Command-line YAML processor

# Cloud and IaC Tools
brew "pulumi"                          # Infrastructure as code tool
brew "crd2pulumi"                      # Generate Pulumi code from Kubernetes CRDs
brew "kube2pulumi"                     # Generate Pulumi code from Kubernetes YAML
brew "pulumictl"                       # Pulumi command-line tool
brew "tf2pulumi"                       # Convert Terraform code to Pulumi
brew "azure-cli"                       # Microsoft Azure command-line tool
brew "kubectl"                         # Kubernetes command-line tool
brew "helm"                            # Kubernetes package manager
brew "cilium-cli"                      # CLI to install, manage & troubleshoot Kubernetes clusters
cask "google-cloud-sdk"                # Google Cloud SDK
brew "doctl"                           # DigitalOcean CLI
brew "flyctl"                          # Fly.io CLI

# Container Tools
brew "podman"                          # Manage pods, containers, and container images
brew "podman-compose"                  # Docker Compose replacement for Podman
cask "docker"                          # Docker desktop
cask "podman-desktop"                  # Podman desktop

# Task Runners and Automation
brew "go-task"                         # Task runner for Go
brew "act"                             # Run GitHub Actions locally

# Databases and Database Tools
brew "turso"                           # Turso database command-line tool
brew "libpq"                           # PostgreSQL C library
brew "sqld"                            # SQL daemon

# Video Meeting Applications
cask "microsoft-teams"                 # Microsoft Teams
cask "zoom"                            # Zoom video conferencing

# Applications
cask "spotify"                         # Spotify music streaming
brew "neovim"                          # Hyperextensible Vim-based text editor
cask "slack"                           # Slack messaging app
cask "sonos"                           # Sonos controller app
brew "tmux"                            # Terminal multiplexer
cask "figma"                           # Figma design tool
cask "discord"                         # Discord chat and voice app
cask "grammarly"                       # Grammarly writing assistant
cask "microsoft-remote-desktop"        # Microsoft Remote Desktop app
cask "postico"                         # PostgreSQL GUI client
cask "cyberduck"                       # FTP and cloud storage browser
cask "adobe-creative-cloud"            # Adobe Creative Cloud
# TODO: Figure out how to handle 1password when it updates itself
# cask "1password"                       # 1Password password manager
cask "1password-cli"                   # 1Password command-line tool
cask "protonvpn"                       # ProtonVPN client
cask "openvpn-connect"                 # OpenVPN client
cask "raycast"                         # Command launcher
cask "rectangle"                       # Window management app
cask "google-chrome"                   # Google Chrome browser
cask "google-drive"                    # Google Drive
cask "google-drive-file-stream"        # Google Drive for desktop
cask "karabiner-elements"              # Keyboard customizer
cask "postman"                         # API platform
cask "ghostty"                         # Modern terminal emulator
cask "proton-mail"                     # ProtonMail client

# Terminal Tools
brew "pv"                              # Pipe viewer
brew "rename"                          # Perl-powered file rename script
brew "rlwrap"                          # Readline wrapper
brew "tree"                            # Display directories as trees
brew "screen"                          # Terminal multiplexer
brew "vbindiff"                        # Visual binary diff
brew "tmate"                           # Instant terminal sharing
brew "asciinema"                       # Record and share terminal sessions
brew "dasel"                           # Query and update data structures from the command line
brew "tldr"                            # Simplified and community-driven man pages
brew "starship"                        # Cross-shell prompt
brew "gh"                              # GitHub CLI

# HTTP and Web Servers
brew "caddy"                           # Fast, multi-platform web server with automatic HTTPS
brew "goreleaser"                      # Deliver Go binaries as fast and easily as possible

# Specific Toolsets
brew "whalebrew"                       # Dockerized CLI applications
brew "gd"                              # Graphics library
brew "ghostscript"                     # PostScript interpreter
brew "rclone"                          # Manage cloud storage
brew "graphviz"                        # Graph visualization software
#
# Obsidian
cask "obsidian"                        # Obsidian note-taking app
